# 7월 30일 과제 (pandas)

## 황 성 윤

In [1]:
import pandas as pd
import numpy as np
import pandas_datareader as pdr

### Q1

- 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
- 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [2]:
s1 = pd.Series([95,88,87,98],index=['국어','영어','수학','사회'])
s2 = pd.Series([87,90,100,98],index=['국어','영어','수학','과학'])

In [3]:
s1 + s2

과학      NaN
국어    182.0
사회      NaN
수학    187.0
영어    178.0
dtype: float64

In [4]:
s1 - s2

과학     NaN
국어     8.0
사회     NaN
수학   -13.0
영어    -2.0
dtype: float64

In [5]:
s1 * s2

과학       NaN
국어    8265.0
사회       NaN
수학    8700.0
영어    7920.0
dtype: float64

In [6]:
s1 / s2

과학         NaN
국어    1.091954
사회         NaN
수학    0.870000
영어    0.977778
dtype: float64

In [7]:
ds = (s2 - s1) / s1 * 100
ds = ds[ds.notnull()]
ds

국어    -8.421053
수학    14.942529
영어     2.272727
dtype: float64

### Q2

- 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
    - 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
    - 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [14]:
data = {
    "담당교사" : ['이연희','채희석','김형수','이수민','한정호'],
    "2015년" : [95,88,95,86,87],
    "2016년" : [90,91,86,89,93],
    "2017년" : [93,92,100,100,85],
    "2018년" : [85,89,94,87,90],
    "2019년" : [90,92,85,86,93]
}
columns = ['담당교사','2015년','2016년','2017년','2018년','2019년']
index = ['국어','영어','수학','과학','사회']
df = pd.DataFrame(data, index=index, columns=columns)
df["2017~2018 성적 증가율(%)"] = ((df["2018년"] - df["2017년"]) / df["2017년"] * 100).round(2)
df["2018~2019 성적 증가율(%)"] = ((df["2019년"] - df["2018년"]) / df["2018년"] * 100).round(2)
df

,담당교사,2015년,2016년,2017년,2018년,2019년,2017~2018 성적 증가율(%),2018~2019 성적 증가율(%)
국어,이연희,95,90,93,85,90,-8.60,5.88
영어,채희석,88,91,92,89,92,-3.26,3.37
수학,김형수,95,86,100,94,85,-6.00,-9.57
과학,이수민,86,89,100,87,86,-13.00,-1.15
사회,한정호,87,93,85,90,93,5.88,3.33

### Q3

- 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [15]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

- 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [16]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

- 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [18]:
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

- 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [20]:
df["평균"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

- 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [21]:
df["영어"]["방자"] = 80
df["평균"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
df

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

- 춘향의 점수를 데이터프레임으로 나타낸다.

In [25]:
df[:1].T

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [31]:
type(df[:1].T)

pandas.core.frame.DataFrame

- 향단의 점수를 시리즈로 나타낸다.

In [29]:
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [30]:
type(df.T["향단"])

pandas.core.series.Series

### Q4

- 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
- 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [34]:
df = pd.DataFrame(np.arange(25).reshape(5,5), index=['a','b','c','d','e'])
df

    0   1   2   3   4
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [35]:
df.loc['a']

0    0
1    1
2    2
3    3
4    4
Name: a, dtype: int32

In [36]:
df.loc['b':'d']

    0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [37]:
df[0] > 10

a    False
b    False
c    False
d     True
e     True
Name: 0, dtype: bool

In [38]:
df[df[0] > 10]

    0   1   2   3   4
d  15  16  17  18  19
e  20  21  22  23  24

In [46]:
df.iloc[0:1,1:3]

   1  2
a  1  2

In [47]:
df.iloc[2:3, 1:3]

    1   2
c  11  12

In [51]:
df[[0]]

    0
a   0
b   5
c  10
d  15
e  20

In [55]:
df[[1]]

    1
a   1
b   6
c  11
d  16
e  21

In [57]:
df.iloc[0:5,0:2]

    0   1
a   0   1
b   5   6
c  10  11
d  15  16
e  20  21

In [58]:
df.iloc[:5,:4]

    0   1   2   3
a   0   1   2   3
b   5   6   7   8
c  10  11  12  13
d  15  16  17  18
e  20  21  22  23

In [59]:
df.iloc[3:5,2:4]

    2   3
d  17  18
e  22  23

### Q5

- 다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

In [60]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

- 1. 타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [62]:
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [64]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 2. 타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [66]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [69]:
titanic["age"].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [73]:
titanic["class"].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [75]:
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

- 3. 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다. 각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [76]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [79]:
titanic_age = titanic["age"]
cats = pd.cut(titanic_age, bins, labels=labels)
freq = cats.value_counts()

In [89]:
# 각 그룹 별 비율 (%)
rate = ((freq / sum(freq)) * 100).round(2)
rate

청년      31.14
중년      28.00
장년      27.86
미성년자     9.86
노년       3.14
Name: age, dtype: float64